contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
/******************************************************************************
*  Filename:       hw_ddi_0_osc.h
*  Revised:        2015-01-15 18:41:47 +0100 (to, 15 jan 2015)
*  Revision:       42400
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_DDI_0_OSC_H__
#define __HW_DDI_0_OSC_H__


//*****************************************************************************
//
// This section defines the register offsets of
// DDI_0_OSC component
//
//*****************************************************************************
// Control 0
#define DDI_0_OSC_O_CTL0                                            0x00000000

// Comtrol 1
#define DDI_0_OSC_O_CTL1                                            0x00000004

// RADC External Configuration
#define DDI_0_OSC_O_RADCEXTCFG                                      0x00000008

// Amplitude Compensation Control
#define DDI_0_OSC_O_AMPCOMPCTL                                      0x0000000C

// Amplitude Compensation Threashold 1
#define DDI_0_OSC_O_AMPCOMPTH1                                      0x00000010

// Amplitude Compensation Threashold 2
#define DDI_0_OSC_O_AMPCOMPTH2                                      0x00000014

// Analog Bypass Values 1
#define DDI_0_OSC_O_ANABYPASSVAL1                                   0x00000018

// Internal register
#define DDI_0_OSC_O_ANABYPASSVAL2                                   0x0000001C

// Analog Test Control
#define DDI_0_OSC_O_ATESTCTL                                        0x00000020

// ADC Doubler Nanoamp Control
#define DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL                            0x00000024

// XOSCHF Control
#define DDI_0_OSC_O_XOSCHFCTL                                       0x00000028

// Low Frequency Oscillator Control
#define DDI_0_OSC_O_LFOSCCTL                                        0x0000002C

// RCOSCHF Control
#define DDI_0_OSC_O_RCOSCHFCTL                                      0x00000030

// Status 0
#define DDI_0_OSC_O_STAT0                                           0x00000034

// Status 1
#define DDI_0_OSC_O_STAT1                                           0x00000038

// Status 2
#define DDI_0_OSC_O_STAT2                                           0x0000003C

//*****************************************************************************
//
// Register: DDI_0_OSC_O_CTL0
//
//*****************************************************************************
// Field: [31]    XTAL_IS_24M
//
// Set based on the accurate high frequency XTAL or BAW.
//
// 0: 48MHz XTAL or 48MHz BAW
// 1: 24MHz XTAL
// ENUMs:
// 48M                  48MHz
// 24M                  24MHz
//
#define DDI_0_OSC_CTL0_XTAL_IS_24M                                  0x80000000
#define DDI_0_OSC_CTL0_XTAL_IS_24M_BITN                             31
#define DDI_0_OSC_CTL0_XTAL_IS_24M_M                                0x80000000
#define DDI_0_OSC_CTL0_XTAL_IS_24M_S                                31
#define DDI_0_OSC_CTL0_XTAL_IS_24M_48M                              0x00000000
#define DDI_0_OSC_CTL0_XTAL_IS_24M_24M                              0x80000000

// Field: [30]    DOUBLER_BYPASS_CTL
//
// When this bit is set, the XOSC_HF doubler is bypassed - i.e. the XOSC_HF clock
// is not double but is instead routed to the output of the doubler.
//
// 0: Hardware controls doubler bypass.
// 1: Doubler is bypassed
//
// The hardware will bypass the doubler when a 48MHz XTAL is connected to
// XOSC_HF.
//
#define DDI_0_OSC_CTL0_DOUBLER_BYPASS_CTL                           0x40000000
#define DDI_0_OSC_CTL0_DOUBLER_BYPASS_CTL_BITN                      30
#define DDI_0_OSC_CTL0_DOUBLER_BYPASS_CTL_M                         0x40000000
#define DDI_0_OSC_CTL0_DOUBLER_BYPASS_CTL_S                         30

// Field: [29]    BYPASS_XOSC_LF_CLK_QUAL
//
// Bypass XOSC_LF clock gating. Extremely useful not to get glitch on sclk_lf.
// Should be '1' once sclk_lf source is switched to xosc_lf.
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL                      0x20000000
#define DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_BITN                 29
#define DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M                    0x20000000
#define DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_S                    29

// Field: [28]    BYPASS_RCOSC_LF_CLK_QUAL
//
// Override enable of clock gate that gates RCOSC_LF clock being fed to GF MUX.
// Extremely useful not to get glitch on sclk_lf. Should be '1' once sclk_lf source
// is switched to rcosc_lf
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL                     0x10000000
#define DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_BITN                28
#define DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M                   0x10000000
#define DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S                   28

// Field: [27:26] DOUBLER_START_DURATION
//
// Controls the Doubler startup duration. This is the time that  determines when
// the doubler output is good from the start of the doubler enable sequence. The
// time the doubler has to lock is determined by this bitfield and also
// DOUBLER_RESET_DURATION. DOUBLER_RESET_DURATION determines when reset ends -
// i.e. locking can start. This field determines when locking must complete. The
// allowable lock time is this setting minus the DOUBLER_RESET_DURATION setting.
//
// 0: 10 us minumum duration
// 1: 12 us minimum duration
// 2: 14 us minimum duration
// 3: 16 us minimum duration
//
//
#define DDI_0_OSC_CTL0_DOUBLER_START_DURATION_M                     0x0C000000
#define DDI_0_OSC_CTL0_DOUBLER_START_DURATION_S                     26

// Field: [25]    DOUBLER_RESET_DURATION
//
// Controls the doubler reset duration - the time that DOULBER_RESET and DOUBLER_EN
// are both active in the beginning of the doubler startup sequence.
//
// 0: 2 us minimum duration
// 1: 3 us minimum duration
//
//
#define DDI_0_OSC_CTL0_DOUBLER_RESET_DURATION                       0x02000000
#define DDI_0_OSC_CTL0_DOUBLER_RESET_DURATION_BITN                  25
#define DDI_0_OSC_CTL0_DOUBLER_RESET_DURATION_M                     0x02000000
#define DDI_0_OSC_CTL0_DOUBLER_RESET_DURATION_S                     25

// Field: [22]    FORCE_KICKSTART_EN
//
// Kickstart the rcosc_hf oscillator if the high-frequency system clock (sclk_hf)
// is enabled while the OSC_DIG  is in the HOLD state (no high frequency oscillator
// is enabled), and the source of sclk_lf is the xosc_hf.
//
// 0: Kickstart disabled
// 1: Kickstart enable.
//
// The sclk_hf source is selected by SCLK_HF_SRC_SEL. It is needed to ensure
// there are no system hangs on very rapid wakeup request following a powerdown
// request.
//
//
#define DDI_0_OSC_CTL0_FORCE_KICKSTART_EN                           0x00400000
#define DDI_0_OSC_CTL0_FORCE_KICKSTART_EN_BITN                      22
#define DDI_0_OSC_CTL0_FORCE_KICKSTART_EN_M                         0x00400000
#define DDI_0_OSC_CTL0_FORCE_KICKSTART_EN_S                         22

