contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
// Field: [0]    SCLK_HF_SRC_SEL
//
// Source select for sclk_hf
// ENUMs:
// RCOSC                High frequency RCOSC clk
// XOSC                 High frequency XOSC or BAW clk (use BAW when
// BAW_MODE_EN = 1
//
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL                              0x00000001
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL_BITN                         0
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL_M                            0x00000001
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL_S                            0
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL_RCOSC                        0x00000000
#define DDI_0_OSC_CTL0_SCLK_HF_SRC_SEL_XOSC                         0x00000001

//*****************************************************************************
//
// Register: DDI_0_OSC_O_CTL1
//
//*****************************************************************************
// Field: [22:18] RCOSCHFCTRIMFRACT
//
// Sets the fractional tuning of the RCOSC_HF capacitor trim. This field only has
// an effect if RCOSC_HF fractional trim is enabled via RCOSCHFCTRIMFRACT_EN.
// This field sets the duty cycle of the signal which enables the capacitor for
// fractional trimming. The field is an unsigned integer value. The duty cycle is
// RCOSCHFCTRIMFRACT/32. The fractional trim capacitor is 2X the size of the
// capacitors controlled by RCOSCHFCTL.RCOSCHF_CTRIM. The effective additional
// capacitance added to the RCOSC_HF is equal to the duty cycle times 2X. E.g. If
// this field is set to 16, then the duty cycle is 50% so the effective trim adds
// one capacitor to the RCOSC_HF capacitance. Setting this field to 8 gives a duty
// cycle of 25% which effectively adds 1/2 of a capacitor. The value of this field
// is calibrated and set via FW.  This field should only be changed when the
// fractional tuning is disabled or when the RCOSC_HF is off.
//
//
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_M                          0x007C0000
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_S                          18

// Field: [17]    RCOSCHFCTRIMFRACT_EN
//
// This field enables the fractional trimming of the RCOSC_HF captrim.
//
// 0: Disabled
// 1: Enabled
//
// When Fractional Trimming is enabled, the effective capacitance for tuning the
// RCOSC_HF frequency can be fractionally increased/decreased by defining the duty
// cycle of the signal that enables the RCOSC_HF Fractional Tuning Capacitor. The
// duty cycle is controlled by RCOSCHFCTRIMFRACT.
//
//
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_EN                         0x00020000
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_EN_BITN                    17
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_EN_M                       0x00020000
#define DDI_0_OSC_CTL1_RCOSCHFCTRIMFRACT_EN_S                       17

// Field: [1:0] XOSC_HF_FAST_START
//
// Set precharge duration of fast startup of the XOSC_HF
//
// 00: Disable
// 01: 3 us
// 10: 5 us
// 11: 8 us
//
// This field enables and sets the duration of the XOSC_HF fast startup mode.
// This field will be set by firmware based on XTAL characteristics and other
// considerations.
#define DDI_0_OSC_CTL1_XOSC_HF_FAST_START_M                         0x00000003
#define DDI_0_OSC_CTL1_XOSC_HF_FAST_START_S                         0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_RADCEXTCFG
//
//*****************************************************************************
// Field: [31:22] HPM_IBIAS_WAIT_CNT
//
// AMPCOMP FSM waits for this count of OSC_DIG clock cycles in order to compensate
// the effect of slow crystal response. HPM_IBIAS_WAIT_CNT*0.5 us is absolute wait
// time and should be close to XTAL's response time towards ibias/cap change
#define DDI_0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_M                   0xFFC00000
#define DDI_0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_S                   22

// Field: [21:16] LPM_IBIAS_WAIT_CNT
//
// FSM waits for LPM_IBIAS_WAIT_CNT clock cycles in the IBIAS_INCREMENT state in
// order to compensate slow response of the xtal. Typical values = 64.
//
#define DDI_0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_M                   0x003F0000
#define DDI_0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_S                   16

// Field: [15:12] IDAC_STEP
//
// IDAC step size that will be used in IBIAS_CAP_UPDATE state. xosc_hf_idac is
// incremented IDAC_STEP times for each iteration of the loop that is performed
// during IBIAS_CAP_UPDATE. This setting is XTAL dependent and applied by FW.
//
//
#define DDI_0_OSC_RADCEXTCFG_IDAC_STEP_M                            0x0000F000
#define DDI_0_OSC_RADCEXTCFG_IDAC_STEP_S                            12

// Field: [11:6] RADC_DAC_TH
//
// RADC threshhold value when in comparator mode. Used when RADC_EXTERNAL_USE_EN
// = 1. RADC_DAC_TH is an unsigned integer input to the DAC that sets the voltage
// that goes to the compare input to the RADC comparator.
//
// The DAC voltage is ~ 0.0153*RADC_DAC_TH + 0.00765.
//
#define DDI_0_OSC_RADCEXTCFG_RADC_DAC_TH_M                          0x00000FC0
#define DDI_0_OSC_RADCEXTCFG_RADC_DAC_TH_S                          6

// Field: [5]    RADC_MODE_IS_SAR
//
// RADC mode when RADC_EXTERNAL_USE_EN = 1.
//
// 0: Comparator mode
// 1: SAR mode
//
#define DDI_0_OSC_RADCEXTCFG_RADC_MODE_IS_SAR                       0x00000020
#define DDI_0_OSC_RADCEXTCFG_RADC_MODE_IS_SAR_BITN                  5
#define DDI_0_OSC_RADCEXTCFG_RADC_MODE_IS_SAR_M                     0x00000020
#define DDI_0_OSC_RADCEXTCFG_RADC_MODE_IS_SAR_S                     5

// Field: [4]    RADC_START_CONV
//
// Start conversion signal when RADC_EXTERNAL_USE_EN = 1.
#define DDI_0_OSC_RADCEXTCFG_RADC_START_CONV                        0x00000010
#define DDI_0_OSC_RADCEXTCFG_RADC_START_CONV_BITN                   4
#define DDI_0_OSC_RADCEXTCFG_RADC_START_CONV_M                      0x00000010
#define DDI_0_OSC_RADCEXTCFG_RADC_START_CONV_S                      4

// Field: [1]    DDI_RADC_CLRZ
//
// Active low clrz for RADC_DIG.
//
// 0: Reset digital logic in the RADC.
// 1: Release reset of digital logic in RADC.
//
// Used when RADC_EXTERNAL_USE_EN = 1.
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ                          0x00000002
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_BITN                     1
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_M                        0x00000002
#define DDI_0_OSC_RADCEXTCFG_DDI_RADC_CLRZ_S                        1

//*****************************************************************************
//
// Register: DDI_0_OSC_O_AMPCOMPCTL
//
//*****************************************************************************
// Field: [30]    AMPCOMP_REQ_MODE
//
// RADC mode during ampcomp_req from AON. FSM forces ADC to be in selected mode
// during ampcomp request (during amplitude maintainance).
//
// 0: Comparator
// 1: 1-time SAR mode
//
// This bit is not used during the ramping up or transitioning from one mode to
// other.
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE                       0x40000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_BITN                  30
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_M                     0x40000000
#define DDI_0_OSC_AMPCOMPCTL_AMPCOMP_REQ_MODE_S                     30

