contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
// Field: [7]    ATESTLF_RCOSCLF_IBIAS_TRIM
//
// Set high to increase the bias current to RCOSC_LF by 25 nA.  Nominal value is 50
// nA.  With this bit enabled current is 75 nA.
//
//
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_RCOSCLF_IBIAS_TRIM               0x00000080
#define DDI_0_OSC_ATESTCTL_ATESTLF_RCOSCLF_IBIAS_TRIM_BITN          7
#define DDI_0_OSC_ATESTCTL_ATESTLF_RCOSCLF_IBIAS_TRIM_M             0x00000080
#define DDI_0_OSC_ATESTCTL_ATESTLF_RCOSCLF_IBIAS_TRIM_S             7

// Field: [6]    ATESTLF_UDIGLDO_IBIAS_TRIM
//
// Set high to enable an extra 25 nA of bias current to uDIGLDO (100% increase from
// nominal).
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_UDIGLDO_IBIAS_TRIM               0x00000040
#define DDI_0_OSC_ATESTCTL_ATESTLF_UDIGLDO_IBIAS_TRIM_BITN          6
#define DDI_0_OSC_ATESTCTL_ATESTLF_UDIGLDO_IBIAS_TRIM_M             0x00000040
#define DDI_0_OSC_ATESTCTL_ATESTLF_UDIGLDO_IBIAS_TRIM_S             6

// Field: [5]    ATESTLF_SOXAUX_IBIAS_TRIM
//
// Set high to enable extra 25 nA to SOCAUX (100% increase from nominal).
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_SOXAUX_IBIAS_TRIM                0x00000020
#define DDI_0_OSC_ATESTCTL_ATESTLF_SOXAUX_IBIAS_TRIM_BITN           5
#define DDI_0_OSC_ATESTCTL_ATESTLF_SOXAUX_IBIAS_TRIM_M              0x00000020
#define DDI_0_OSC_ATESTCTL_ATESTLF_SOXAUX_IBIAS_TRIM_S              5

// Field: [4:3] ATESTLF_OSC_1P2V
//
// Select 1.2V output test clock to drive the ATEST1 signal.
//
// 00: RCOSC_LF clock
// 01: BAW HF clock
// 10: XOSC_LF clock
//
// This field only selects the source to be driven. The output is enabled to
// drive ATEST1 by ATESTLF_EN.
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_OSC_1P2V_M                       0x00000018
#define DDI_0_OSC_ATESTCTL_ATESTLF_OSC_1P2V_S                       3

// Field: [2:1] ATESTLF_OSC_1P8V
//
// Select the 1.8V test output to drive ATEST0.
//
// 00: BAW analog test
// 01: XOSC_LF analog test
// 10: NANOAMP_BIAS test current
// 11: RCOSC_LF VDD_LOCAL
//
// This field only selects the source to be driven. The output is enabled to
// drive ATEST0 by ATESTLF_EN.
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_OSC_1P8V_M                       0x00000006
#define DDI_0_OSC_ATESTCTL_ATESTLF_OSC_1P8V_S                       1

// Field: [0]    ATESTLF_EN
//
// Enables the 1p8V test output selected by ATESTLF_OSC_1P8V.
//
// 0: Disable
// 1: Enable
//
//
#define DDI_0_OSC_ATESTCTL_ATESTLF_EN                               0x00000001
#define DDI_0_OSC_ATESTCTL_ATESTLF_EN_BITN                          0
#define DDI_0_OSC_ATESTCTL_ATESTLF_EN_M                             0x00000001
#define DDI_0_OSC_ATESTCTL_ATESTLF_EN_S                             0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_ADCDOUBLERNANOAMPCTL
//
//*****************************************************************************
// Field: [24]    NANOAMP_BIAS_ENABLE
//
// Enables NANOAMP_BIAS.
//
// 0: Disabled
// 1: Enabled
//
// Must be enabled for RCOSC_LF, XOSCLF, uDIGLDO, and SOCAUX to receive needed
// bias currents. This bit is normally set high after reset or after waking from
// Shutdown.
//
//
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE          0x01000000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE_BITN     24
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE_M        0x01000000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_NANOAMP_BIAS_ENABLE_S        24

// Field: [23]    SPARE23
//
// Software should not rely on the value of a reserved. Writing any other value
// than the reset value may result in undefined behavior
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_SPARE23                      0x00800000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_SPARE23_BITN                 23
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_SPARE23_M                    0x00800000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_SPARE23_S                    23

// Field: [22]    DBLR_ATEST_SELECT
//
// Analog test select for Doubler
//
// 0: VCTRL Output (ATEST0=VCTRL, ATEST1=DOUBLER_RST)
// 1: Bias Output (ATEST0=VBP, ATEST1=VBN)
//
// Used when DBLR_ATEST_ENABLE = 1
// DOUBLER_RST allows control of DOUBLER RST signal via ATEST
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT            0x00400000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT_BITN       22
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT_M          0x00400000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_SELECT_S          22

// Field: [21]    DBLR_ATEST_ENABLE
//
// Enable ATEST for DBLR.  If enabled used DBLR_ATEST_SELECT to set ATEST bit.
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE            0x00200000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE_BITN       21
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE_M          0x00200000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_ATEST_ENABLE_S          21

// Field: [20]    DBLR_TOOHI_MODE
//
// Not used.
//
//
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_TOOHI_MODE              0x00100000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_TOOHI_MODE_BITN         20
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_TOOHI_MODE_M            0x00100000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_TOOHI_MODE_S            20

// Field: [19]    DBLR_LOOP_FILTER_CAP
//
// Loop filter cap
//
// 0: 100% Nominal (17.5 pF)
// 1: 83% Nominal; (14.5 Pf)
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP         0x00080000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP_BITN    19
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP_M       0x00080000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_CAP_S       19

// Field: [18:17] DBLR_LOOP_FILTER_RESET_VOLTAGE
//
// Loop filter reset voltage
//
// 10: 0.533*VDD = 0.666V
// 11: 0.615*VDD = 0.768V
// 00: 0.667*VDD = 0.833V
// 01: 0.800*VDD = 1.000V
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_M \
                                 0x00060000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DBLR_LOOP_FILTER_RESET_VOLTAGE_S 17

// Field: [16]    DOUBLER_BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DOUBLER_BIAS_DIS             0x00010000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DOUBLER_BIAS_DIS_BITN        16
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DOUBLER_BIAS_DIS_M           0x00010000
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_DOUBLER_BIAS_DIS_S           16

