contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
// Field: [9]    RADC_BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_RADC_BIAS_DIS                0x00000200
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_RADC_BIAS_DIS_BITN           9
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_RADC_BIAS_DIS_M              0x00000200
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_RADC_BIAS_DIS_S              9

// Field: [8:7] ADC_ATEST_SRC
//
// Select ATEST0 muxed output from RADC mux. Mux is enabled by ADC_EN_ATEST.
//
// 0x0: Output of DAC - indicates if the current compare input is greater than
// the reference
// 0x1: COMP_IN (Comparator input signal after filtering and sample-hold)
// 0x2: FILTER_OUT (Comparator input signal after filtering - not sample-hold)
// 0x3: DAC_REF (DAC Reference Voltage - input is compared to this)
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_ATEST_SRC_M              0x00000180
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_ATEST_SRC_S              7

// Field: [6]    ADC_EN_ATEST
//
// Enable ATEST0 mux whose output is selected by the ADC_ATEST_SRC bitfield.
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST                 0x00000040
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST_BITN            6
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST_M               0x00000040
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_EN_ATEST_S               6

// Field: [5]    ADC_SH_MODE_EN
//
// Enable S&H Mode
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN               0x00000020
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN_BITN          5
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN_M             0x00000020
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_MODE_EN_S             5

// Field: [4]    ADC_SH_VBUF_EN
//
// Enable S&H voltage buffer mode
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN               0x00000010
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN_BITN          4
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN_M             0x00000010
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_SH_VBUF_EN_S             4

// Field: [3:2] ADC_MUX_SEL
//
// Select line for 4-to-1 mux that feeds ADC input. Default is '00' Selects OSC_DIG
// input
//
// 00: Peak detector output
// 01: Vtemp
// 10: ATEST0
// 11: ATEST1
//
// Must be programmed to select the Peak detector output if xosc_hf is enabled
// so that amplitude compensation can be performed correctly so the clock is not
// lost.
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_MUX_SEL_M                0x0000000C
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_MUX_SEL_S                2

// Field: [1:0] ADC_IREF_CTRL
//
// Select RADC IBIAS source.
//
// 00: Use V2I
// 10: Connect external IREF to DAC
// 01: Use IREF 2uA from REFSYS for DAC
// 11: Reserved
//
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_M              0x00000003
#define DDI_0_OSC_ADCDOUBLERNANOAMPCTL_ADC_IREF_CTRL_S              0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_XOSCHFCTL
//
//*****************************************************************************
// Field: [11]    HPBUFF_BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define DDI_0_OSC_XOSCHFCTL_HPBUFF_BIAS_DIS                         0x00000800
#define DDI_0_OSC_XOSCHFCTL_HPBUFF_BIAS_DIS_BITN                    11
#define DDI_0_OSC_XOSCHFCTL_HPBUFF_BIAS_DIS_M                       0x00000800
#define DDI_0_OSC_XOSCHFCTL_HPBUFF_BIAS_DIS_S                       11

// Field: [10]    PEAKDET_BIAS_DIS
//
// Disable dummy bias current.
//
// 0: Dummy bias current on (Default)
// 1: Dummy bias current off
//
//
#define DDI_0_OSC_XOSCHFCTL_PEAKDET_BIAS_DIS                        0x00000400
#define DDI_0_OSC_XOSCHFCTL_PEAKDET_BIAS_DIS_BITN                   10
#define DDI_0_OSC_XOSCHFCTL_PEAKDET_BIAS_DIS_M                      0x00000400
#define DDI_0_OSC_XOSCHFCTL_PEAKDET_BIAS_DIS_S                      10

// Field: [9:8] PEAK_DET_ITRIM
//
// Adjust Ibias trim of peak detector
//
// 00:  16 uA (default)
// 01:  20 uA
// 10:  24 uA
// 11:  28 uA
//
// This value is XTAL dependent and set by FW.
#define DDI_0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_M                        0x00000300
#define DDI_0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_S                        8

// Field: [7]    HP_ALT_BIAS
//
// Improve phase noise and reduce power consumption at the cost of reduced supply
// rejection.
//
// 0: Disable
// 1: Enable
#define DDI_0_OSC_XOSCHFCTL_HP_ALT_BIAS                             0x00000080
#define DDI_0_OSC_XOSCHFCTL_HP_ALT_BIAS_BITN                        7
#define DDI_0_OSC_XOSCHFCTL_HP_ALT_BIAS_M                           0x00000080
#define DDI_0_OSC_XOSCHFCTL_HP_ALT_BIAS_S                           7

// Field: [6]    BYPASS
//
// Bypass XOSC_HF core and pass through external clock from X48P.
//
//
#define DDI_0_OSC_XOSCHFCTL_BYPASS                                  0x00000040
#define DDI_0_OSC_XOSCHFCTL_BYPASS_BITN                             6
#define DDI_0_OSC_XOSCHFCTL_BYPASS_M                                0x00000040
#define DDI_0_OSC_XOSCHFCTL_BYPASS_S                                6

// Field: [5]    TESTMUX_EN
//
// Enable XOSC_HF ATEST Outputs
//
// 0: XOSC_HF ATEST outputs disabled
// 1: XOSC_HF ATEST outputs enabled.
//
// When enabled, the XOSC_HF COREREG bias current can be connected to drive
// ATEST0, and the HP Buffer clock or LP Buffer clock can be connected to drive
// ATEST1.
//
// This enable causes the XOSC_HF to drive the ATEST signals to a mux controlled
// by ATESTCTL.ATEST_OSC_HF_SEL. To drive these signals further on to the ATEST
// outputs, that mux must be programmed to select these inputs.
//
#define DDI_0_OSC_XOSCHFCTL_TESTMUX_EN                              0x00000020
#define DDI_0_OSC_XOSCHFCTL_TESTMUX_EN_BITN                         5
#define DDI_0_OSC_XOSCHFCTL_TESTMUX_EN_M                            0x00000020
#define DDI_0_OSC_XOSCHFCTL_TESTMUX_EN_S                            5

