contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
// Field: [8]    CLK_DCDC_EN
//
// CLK_DCDC_EN
#define DDI_0_OSC_STAT1_CLK_DCDC_EN                                 0x00000100
#define DDI_0_OSC_STAT1_CLK_DCDC_EN_BITN                            8
#define DDI_0_OSC_STAT1_CLK_DCDC_EN_M                               0x00000100
#define DDI_0_OSC_STAT1_CLK_DCDC_EN_S                               8

// Field: [7]    SCLK_HF_GOOD
//
// SCLK_HF_GOOD
#define DDI_0_OSC_STAT1_SCLK_HF_GOOD                                0x00000080
#define DDI_0_OSC_STAT1_SCLK_HF_GOOD_BITN                           7
#define DDI_0_OSC_STAT1_SCLK_HF_GOOD_M                              0x00000080
#define DDI_0_OSC_STAT1_SCLK_HF_GOOD_S                              7

// Field: [6]    SCLK_MF_GOOD
//
// SCLK_MF_GOOD
#define DDI_0_OSC_STAT1_SCLK_MF_GOOD                                0x00000040
#define DDI_0_OSC_STAT1_SCLK_MF_GOOD_BITN                           6
#define DDI_0_OSC_STAT1_SCLK_MF_GOOD_M                              0x00000040
#define DDI_0_OSC_STAT1_SCLK_MF_GOOD_S                              6

// Field: [5]    SCLK_LF_GOOD
//
// SCLK_LF_GOOD
#define DDI_0_OSC_STAT1_SCLK_LF_GOOD                                0x00000020
#define DDI_0_OSC_STAT1_SCLK_LF_GOOD_BITN                           5
#define DDI_0_OSC_STAT1_SCLK_LF_GOOD_M                              0x00000020
#define DDI_0_OSC_STAT1_SCLK_LF_GOOD_S                              5

// Field: [4]    ACLK_ADC_GOOD
//
// ACLK_ADC_GOOD
#define DDI_0_OSC_STAT1_ACLK_ADC_GOOD                               0x00000010
#define DDI_0_OSC_STAT1_ACLK_ADC_GOOD_BITN                          4
#define DDI_0_OSC_STAT1_ACLK_ADC_GOOD_M                             0x00000010
#define DDI_0_OSC_STAT1_ACLK_ADC_GOOD_S                             4

// Field: [3]    ACLK_TDC_GOOD
//
// ACLK_TDC_GOOD
#define DDI_0_OSC_STAT1_ACLK_TDC_GOOD                               0x00000008
#define DDI_0_OSC_STAT1_ACLK_TDC_GOOD_BITN                          3
#define DDI_0_OSC_STAT1_ACLK_TDC_GOOD_M                             0x00000008
#define DDI_0_OSC_STAT1_ACLK_TDC_GOOD_S                             3

// Field: [2]    ACLK_REF_GOOD
//
// ACLK_REF_GOOD
#define DDI_0_OSC_STAT1_ACLK_REF_GOOD                               0x00000004
#define DDI_0_OSC_STAT1_ACLK_REF_GOOD_BITN                          2
#define DDI_0_OSC_STAT1_ACLK_REF_GOOD_M                             0x00000004
#define DDI_0_OSC_STAT1_ACLK_REF_GOOD_S                             2

// Field: [1]    CLK_CHP_GOOD
//
// CLK_CHP_GOOD
#define DDI_0_OSC_STAT1_CLK_CHP_GOOD                                0x00000002
#define DDI_0_OSC_STAT1_CLK_CHP_GOOD_BITN                           1
#define DDI_0_OSC_STAT1_CLK_CHP_GOOD_M                              0x00000002
#define DDI_0_OSC_STAT1_CLK_CHP_GOOD_S                              1

// Field: [0]    CLK_DCDC_GOOD
//
// CLK_DCDC_GOOD
#define DDI_0_OSC_STAT1_CLK_DCDC_GOOD                               0x00000001
#define DDI_0_OSC_STAT1_CLK_DCDC_GOOD_BITN                          0
#define DDI_0_OSC_STAT1_CLK_DCDC_GOOD_M                             0x00000001
#define DDI_0_OSC_STAT1_CLK_DCDC_GOOD_S                             0

//*****************************************************************************
//
// Register: DDI_0_OSC_O_STAT2
//
//*****************************************************************************
// Field: [31:26] ADC_DCBIAS
//
// DC Bias read by RADC during SAR mode
// The vaue is an unsigned interger. It is used for debug only.
//
//
#define DDI_0_OSC_STAT2_ADC_DCBIAS_M                                0xFC000000
#define DDI_0_OSC_STAT2_ADC_DCBIAS_S                                26

// Field: [25]    HPM_RAMP1_THMET
//
// Indication of threshhold is met for hpm_ramp1
#define DDI_0_OSC_STAT2_HPM_RAMP1_THMET                             0x02000000
#define DDI_0_OSC_STAT2_HPM_RAMP1_THMET_BITN                        25
#define DDI_0_OSC_STAT2_HPM_RAMP1_THMET_M                           0x02000000
#define DDI_0_OSC_STAT2_HPM_RAMP1_THMET_S                           25

// Field: [24]    HPM_RAMP2_THMET
//
// Indication of threshhold is met for hpm_ramp2
#define DDI_0_OSC_STAT2_HPM_RAMP2_THMET                             0x01000000
#define DDI_0_OSC_STAT2_HPM_RAMP2_THMET_BITN                        24
#define DDI_0_OSC_STAT2_HPM_RAMP2_THMET_M                           0x01000000
#define DDI_0_OSC_STAT2_HPM_RAMP2_THMET_S                           24

// Field: [23]    HPM_RAMP3_THMET
//
// Indication of threshhold is met for hpm_ramp3
#define DDI_0_OSC_STAT2_HPM_RAMP3_THMET                             0x00800000
#define DDI_0_OSC_STAT2_HPM_RAMP3_THMET_BITN                        23
#define DDI_0_OSC_STAT2_HPM_RAMP3_THMET_M                           0x00800000
#define DDI_0_OSC_STAT2_HPM_RAMP3_THMET_S                           23

// Field: [22]    IBIAS_DEC_WITH_MEASURE_DONE
//
// Condition to exit ibias_dec_with_measure is met
#define DDI_0_OSC_STAT2_IBIAS_DEC_WITH_MEASURE_DONE                 0x00400000
#define DDI_0_OSC_STAT2_IBIAS_DEC_WITH_MEASURE_DONE_BITN            22
#define DDI_0_OSC_STAT2_IBIAS_DEC_WITH_MEASURE_DONE_M               0x00400000
#define DDI_0_OSC_STAT2_IBIAS_DEC_WITH_MEASURE_DONE_S               22

// Field: [21]    IBIAS_WAIT_CNTR_DONE
//
// Condition to exit ibias_wait_cntr is met
#define DDI_0_OSC_STAT2_IBIAS_WAIT_CNTR_DONE                        0x00200000
#define DDI_0_OSC_STAT2_IBIAS_WAIT_CNTR_DONE_BITN                   21
#define DDI_0_OSC_STAT2_IBIAS_WAIT_CNTR_DONE_M                      0x00200000
#define DDI_0_OSC_STAT2_IBIAS_WAIT_CNTR_DONE_S                      21

// Field: [20]    IDAC_INCREMENT_DONE
//
// Condition to exit idac_increment is met
#define DDI_0_OSC_STAT2_IDAC_INCREMENT_DONE                         0x00100000
#define DDI_0_OSC_STAT2_IDAC_INCREMENT_DONE_BITN                    20
#define DDI_0_OSC_STAT2_IDAC_INCREMENT_DONE_M                       0x00100000
#define DDI_0_OSC_STAT2_IDAC_INCREMENT_DONE_S                       20

// Field: [19]    IBIAS_CAP_UPDATE_DONE
//
// Condition to exit ibias_cap_updated is met
#define DDI_0_OSC_STAT2_IBIAS_CAP_UPDATE_DONE                       0x00080000
#define DDI_0_OSC_STAT2_IBIAS_CAP_UPDATE_DONE_BITN                  19
#define DDI_0_OSC_STAT2_IBIAS_CAP_UPDATE_DONE_M                     0x00080000
#define DDI_0_OSC_STAT2_IBIAS_CAP_UPDATE_DONE_S                     19

