contiki-os/contiki/cc26xxware/inc/hw_ddi_0_osc.h
// Field: [18]    IDAC_DECREMENT_WITH_MEASURE_DONE
//
// Condition to exit idac_dec_with_measure is met
#define DDI_0_OSC_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE            0x00040000
#define DDI_0_OSC_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE_BITN       18
#define DDI_0_OSC_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE_M          0x00040000
#define DDI_0_OSC_STAT2_IDAC_DECREMENT_WITH_MEASURE_DONE_S          18

// Field: [17]    IBIAS_INCREMENT_DONE
//
// Condition to exit ibias_inc is met
#define DDI_0_OSC_STAT2_IBIAS_INCREMENT_DONE                        0x00020000
#define DDI_0_OSC_STAT2_IBIAS_INCREMENT_DONE_BITN                   17
#define DDI_0_OSC_STAT2_IBIAS_INCREMENT_DONE_M                      0x00020000
#define DDI_0_OSC_STAT2_IBIAS_INCREMENT_DONE_S                      17

// Field: [16]    RAMP_DOWN_TO_INIT_DONE
//
// counter for ramp down to initi is done. Use for debug
#define DDI_0_OSC_STAT2_RAMP_DOWN_TO_INIT_DONE                      0x00010000
#define DDI_0_OSC_STAT2_RAMP_DOWN_TO_INIT_DONE_BITN                 16
#define DDI_0_OSC_STAT2_RAMP_DOWN_TO_INIT_DONE_M                    0x00010000
#define DDI_0_OSC_STAT2_RAMP_DOWN_TO_INIT_DONE_S                    16

// Field: [15:12] RAMPSTATE
//
// xosc_hf amplitude compensation FSM
//
// This is identical to STAT1.RAMPSTATE. See that description for encoding.
//
#define DDI_0_OSC_STAT2_RAMPSTATE_M                                 0x0000F000
#define DDI_0_OSC_STAT2_RAMPSTATE_S                                 12

// Field: [11:9] ADCSTATE
//
// ADC FSM State.
// Used by amplitude compensation FSM.
// ENUMs:
// ADC_RESET            ADC_RESET
// ADC_IDLE             ADC_IDLE
// ADC_SC               ADC_SC
// ADC_RDDCB            ADC_RDDCB
// ADC_RDAMP            ADC_RDAMP
// ADC_CALC             ADC_CALC
//
#define DDI_0_OSC_STAT2_ADCSTATE_M                                  0x00000E00
#define DDI_0_OSC_STAT2_ADCSTATE_S                                  9
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_RESET                          0x00000000
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_IDLE                           0x00000200
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_SC                             0x00000400
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_RDDCB                          0x00000600
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_RDAMP                          0x00000800
#define DDI_0_OSC_STAT2_ADCSTATE_ADC_CALC                           0x00000A00

// Field: [8]    ADC_COMP_P
//
// LDO Status in BAW mode and comparator output in regular mode. Should be ignored
// in regular mode
//
//
#define DDI_0_OSC_STAT2_ADC_COMP_P                                  0x00000100
#define DDI_0_OSC_STAT2_ADC_COMP_P_BITN                             8
#define DDI_0_OSC_STAT2_ADC_COMP_P_M                                0x00000100
#define DDI_0_OSC_STAT2_ADC_COMP_P_S                                8

// Field: [7]    ADC_COMP_M
//
// BAW_CLKGOOD in BAW mode and not used in regular mode
//
//
#define DDI_0_OSC_STAT2_ADC_COMP_M                                  0x00000080
#define DDI_0_OSC_STAT2_ADC_COMP_M_BITN                             7
#define DDI_0_OSC_STAT2_ADC_COMP_M_M                                0x00000080
#define DDI_0_OSC_STAT2_ADC_COMP_M_S                                7

// Field: [6:4] AMPCOMP_OF_UF
//
// overflow and underflow status in FSM
//
// 0x0: No overlow or underflow
// 0x1: IDAC underflow in HPM_RAMP3
// 0x2: IDAC underflow in IDAC_DECREMENT_WITH_MEASURE.
// 0x4: IDAC underflow or overflow in HPM_UPDATE or LPM_UPDATE
#define DDI_0_OSC_STAT2_AMPCOMP_OF_UF_M                             0x00000070
#define DDI_0_OSC_STAT2_AMPCOMP_OF_UF_S                             4

// Field: [3]    AMPCOMP_REQ
//
// ampcomp_req
#define DDI_0_OSC_STAT2_AMPCOMP_REQ                                 0x00000008
#define DDI_0_OSC_STAT2_AMPCOMP_REQ_BITN                            3
#define DDI_0_OSC_STAT2_AMPCOMP_REQ_M                               0x00000008
#define DDI_0_OSC_STAT2_AMPCOMP_REQ_S                               3

// Field: [2]    XOSC_HF_AMPGOOD
//
// amplitude of xosc_hf is within the required threshold (set by DDI). Not used for
// anything just for debug/status
#define DDI_0_OSC_STAT2_XOSC_HF_AMPGOOD                             0x00000004
#define DDI_0_OSC_STAT2_XOSC_HF_AMPGOOD_BITN                        2
#define DDI_0_OSC_STAT2_XOSC_HF_AMPGOOD_M                           0x00000004
#define DDI_0_OSC_STAT2_XOSC_HF_AMPGOOD_S                           2

// Field: [1]    XOSC_HF_FREQGOOD
//
// frequency of xosc_hf is good to use for the digital clocks
#define DDI_0_OSC_STAT2_XOSC_HF_FREQGOOD                            0x00000002
#define DDI_0_OSC_STAT2_XOSC_HF_FREQGOOD_BITN                       1
#define DDI_0_OSC_STAT2_XOSC_HF_FREQGOOD_M                          0x00000002
#define DDI_0_OSC_STAT2_XOSC_HF_FREQGOOD_S                          1

// Field: [0]    XOSC_HF_RF_FREQGOOD
//
// frequency of xosc_hf is within +/- 20 ppm and xosc_hf is good for radio
// operations. Used for SW to start synthesizer.
#define DDI_0_OSC_STAT2_XOSC_HF_RF_FREQGOOD                         0x00000001
#define DDI_0_OSC_STAT2_XOSC_HF_RF_FREQGOOD_BITN                    0
#define DDI_0_OSC_STAT2_XOSC_HF_RF_FREQGOOD_M                       0x00000001
#define DDI_0_OSC_STAT2_XOSC_HF_RF_FREQGOOD_S                       0

#endif // __HW_DDI_0_OSC_H__
